src/cf/Enums/СпособыУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыУведомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКонтакте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоPush</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПочте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыУведомления/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, поддерживает ли способ уведомления локальные уведомления.
//
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления - Способ уведомления.
// 
// Возвращаемое значение:
//  Булево - Способ уведомления поддерживает локальные уведомления.
//
Функция ПоддерживаетЛокальныеУведомления(СпособУведомления) Экспорт
	
	Возврат СпособУведомления <> Окном;
	
КонецФункции

// Определяет тип внешней системы по способу уведомления
// 
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления.
// 
// Возвращаемое значение:
//  Строка - Тип внешней системы.
//
Функция ТипВнешнейСистемы(СпособУведомления) Экспорт
	
	Если СпособУведомления = Telegram Тогда
		
		ТипВнешнейСистемы = "Telegram";
		
	ИначеЕсли СпособУведомления = ВКонтакте Тогда
		
		ТипВнешнейСистемы = "VK";
		
	Иначе
		
		ТипВнешнейСистемы = "";
		
	КонецЕсли;
	
	Возврат ТипВнешнейСистемы;
	
КонецФункции

// Определяет способ уведомления по типу внешней системы.
// 
// Параметры:
//  ТипВнешнейСистемы - Строка.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыУведомления - Способ уведомления по типу внешней системы.
//
Функция НайтиПоТипуВнешнейСистемы(ТипВнешнейСистемы) Экспорт
	
	Если ТипВнешнейСистемы = "Telegram" Тогда
		
		СпособУведомления = Telegram;
		
	ИначеЕсли ТипВнешнейСистемы = "VK" Тогда
		
		СпособУведомления = ВКонтакте;
		
	Иначе
		
		СпособУведомления = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат СпособУведомления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
